
## Plan Result (prod)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.db-rd-judicial-ref-v16.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.db-rd-judicial-ref-v16.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "action_group-rd-judicial-ref-api-postgres-db-v16-prod"
      + resource_group_name = "rd-judicial-ref-api-postgres-db-v16-data-prod"
      + short_name          = "action_group"
      + tags                = {
          + "application"         = "reference-data"
          + "builtFrom"           = "https://github.com/HMCTS/rd-judicial-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "production"
          + "managedBy"           = "Reference Data"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_rd-judicial-ref-api-postgres-db-v16-prod"
      + resource_group_name      = "rd-judicial-ref-api-postgres-db-v16-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-judicial-ref-api-postgres-db-v16-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-judicial-ref-api-postgres-db-v16-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "reference-data"
          + "builtFrom"           = "https://github.com/HMCTS/rd-judicial-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "production"
          + "managedBy"           = "Reference Data"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_rd-judicial-ref-api-postgres-db-v16-prod"
      + resource_group_name      = "rd-judicial-ref-api-postgres-db-v16-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-judicial-ref-api-postgres-db-v16-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-judicial-ref-api-postgres-db-v16-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "reference-data"
          + "builtFrom"           = "https://github.com/HMCTS/rd-judicial-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "production"
          + "managedBy"           = "Reference Data"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.db-rd-judicial-ref-v16.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_rd-judicial-ref-api-postgres-db-v16-prod"
      + resource_group_name      = "rd-judicial-ref-api-postgres-db-v16-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-judicial-ref-api-postgres-db-v16-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-judicial-ref-api-postgres-db-v16-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "reference-data"
          + "builtFrom"           = "https://github.com/HMCTS/rd-judicial-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "production"
          + "managedBy"           = "Reference Data"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":949,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->